SimulationDatabase/PeriodicHill/Template/0/nutSwitch
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      nutSwitch;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
0.000763629366935
0.000961955551752
0.000359300394952
5.2310230139e-05
0.000137700861267
6.30112825194e-05
2.42198141247e-05
1.37903094951e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
5.36511922543e-15
5.37031198617e-15
5.33883249556e-15
5.1537266801e-15
4.76669334667e-15
4.4956830741e-15
4.45462217609e-15
4.60651349463e-15
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
5.74725694574e-15
5.74725823634e-15
5.74726084839e-15
5.74726465006e-15
5.74726951899e-15
5.74727538241e-15
5.74728212187e-15
5.74728959096e-15
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
