SimulationDatabase/PeriodicHill/Template/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//numberOfSubdomains 20;

//method          scotch;       //four methods in total, 


numberOfSubdomains 12;
 
method          simple;
 
simpleCoeffs
{
    n               (4 3 1);
    delta           0.001;
}

distributed     no;
 
roots           
(
);


// ************************************************************************* //
