SimulationDatabase/PeriodicHill/Template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*
    p
    {
        solver           GAMG;
        tolerance        1e-12;//1e-12;
        relTol           0.001;//0.001;
        minIter          5;
        maxIter          200;
        smoother         GaussSeidel; // DIC; //DICGaussSeidel; //FDIC;
        nPreSweeps       0;
        nPostSweeps      2;
        //nFinestSweeps    3;
        //scaleCorrection true;
        //directSolveCoarsest false;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 500;    // 500
        agglomerator     faceAreaPair;
        mergeLevels      1;    // 3
    }
*/

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;//PBiCG;//
        //preconditioner  DILU;
        smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-10;
        relTol          0.01;
    }
/*
    k
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.1;
    }


    omega
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.1;
    }


    epsilon
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-09;//1e-09;
        relTol          0.1;
    }
    
    R
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }


    nuTilda
    {
        solver          PBiCG;//smoothSolver;
        preconditioner  DILU;
        //smoother        GaussSeidel;
        //nSweeps         2
        tolerance       1e-20;
        relTol          0.001;
    }*/
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefPoint (2 1 0);
    pRefValue 0;
    residualControl
    {
          p               	1e-15;//1e-4;
          U               	1e-15;//1e-10;//1e-5;
	  //nut			1e-6;//1e-4;
          //"(k|epsilon)" 	1e-12;//1e-4;
    }
}

relaxationFactors
{
    p               0.2;//0.2;
    U               0.7;//0.5;
    k               0.7;//0.7;
    omega           0.7;//0.7;
    epsilon         0.7;//0.7;
    //R               0.7;
    //nuTilda         0.7;
}


// ************************************************************************* //
