SimulationDatabase/PeriodicHill/Template/system/pressureCoefficient
type            pressure;
libs            (fieldFunctionObjects);

writeControl    writeTime;

mode            staticCoeff;

result          cp;

rho             rhoInf;
rhoInf          1;
pInf            0;
UInf            (1. 0 0);
