SimulationDatabase/PeriodicHill/Template/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


type            sets;
libs            (sampling);

writeControl    onEnd;

interpolationScheme cellPoint;

setFormat       raw;

fields          (k k_Frozen U U_Frozen turbulenceProperties:devReff bijDelta bijDeltaFrozen p);

sets
{
    Uref
    {
        type    cloud;
        axis    y;
        points  ((0. 5. 1.5));
    }

    x_by_h_0.1
    {
        type    face;
        axis    y;
        start   (0.1 0 0);
        end     (0.1 3 0);
        nPoints 100;
    }
    
    x_by_h_1
    {
        type    face;
        axis    y;
        start   (1. 0 0);
        end     (1. 3 0);
        nPoints 100;
    }
    
    x_by_h_2
    {
        type    face;
        axis    y;
        start   (2. 0 0);
        end     (2. 3 0);
        nPoints 100;
    }
    
    x_by_h_3
    {
        type    face;
        axis    y;
        start   (3. 0 0);
        end     (3. 3 0);
        nPoints 100;
    }
    
    
    x_by_h_4
    {
        type    face;
        axis    y;
        start   (4. 0 0);
        end     (4. 3 0);
        nPoints 100;
    }
    x_by_h_5
    {
        type    face;
        axis    y;
        start   (5. 0 0);
        end     (5. 3 0);
        nPoints 100;
    }
    
    x_by_h_6
    {
        type    face;
        axis    y;
        start   (6. 0 0);
        end     (6. 3 0);
        nPoints 100;
    }
    
    x_by_h_7
    {
        type    face;
        axis    y;
        start   (7. 0 0);
        end     (7. 3 0);
        nPoints 100;
    }
    
    
    x_by_h_8
    {
        type    face;
        axis    y;
        start   (8. 0 0);
        end     (8. 3 0);
        nPoints 100;
    }
    
    
}


// ************************************************************************* //
