SimulationDatabase/PeriodicHill/Template/system/sampleCp
type            patchProbes;
libs            (sampling);
writeControl    writeTime;

patch           bottomWall;
probeLocations  ();
fields          (cp);
